Tekla Open API Reference for Tekla Structures 2025
AnalysisAreaPolygon.Positions Property
 The positions of the area polygon.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisPosition> Positions { get; set; }
Public Property Positions As List(Of AnalysisPosition)
	Get
	Set
Property Value
Type: List<AnalysisPosition>
See Also
Reference
AnalysisAreaPolygon Class
Tekla.Structures.Analysis Namespace